Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/include/pic32cx1012bz25032.h
/**
 * \brief Header file for PIC32CX1012BZ25032
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-07-31T00:50:54Z */
#ifndef _PIC32CX1012BZ25032_H_
#define _PIC32CX1012BZ25032_H_

// Header version uses Semantic Versioning 2.0.0 (https://semver.org/)
#define HEADER_FORMAT_VERSION "2.0.0"

#define HEADER_FORMAT_VERSION_MAJOR (2)
#define HEADER_FORMAT_VERSION_MINOR (0)

/** \addtogroup PIC32CX1012BZ25032_definitions b'PIC32CX1012BZ25032 definitions
  This file defines all structures and symbols for PIC32CX1012BZ25032:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions'
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_U_) || defined(_L_) || defined(_UL_)
#    error "Integer Literals macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with adding suffixes to integer literal constants for C/C++ */
#  define _U_(x) (x ## U)    /**< C code: Unsigned integer literal constant value */
#  define _L_(x) (x ## L)    /**< C code: Long integer literal constant value */
#  define _UL_(x) (x ## UL)  /**< C code: Unsigned Long integer literal constant value */

#else /* Assembler */

#  define _U_(x) x    /**< Assembler: Unsigned integer literal constant value */
#  define _L_(x) x    /**< Assembler: Long integer literal constant value */
#  define _UL_(x) x   /**< Assembler: Unsigned Long integer literal constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */
/** @}  b'end of Atmel Global Defines' */

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR PIC32CX1012BZ25032                                 */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M4 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /**< -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /**< -13 Hard Fault, all classes of Fault    */
  MemoryManagement_IRQn     = -12, /**< -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  BusFault_IRQn             = -11, /**< -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn           = -10, /**< -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SVCall_IRQn               =  -5, /**< -5  System Service Call via SVC instruction */
  DebugMonitor_IRQn         =  -4, /**< -4  Debug Monitor                       */
  PendSV_IRQn               =  -2, /**< -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /**< -1  System Tick Timer                   */
/******  PIC32CX1012BZ25032 specific Interrupt Numbers ***********************************/
  RTC_IRQn                  =   0, /**< 0   Real-Time Counter (RTC)             */
  EIC_IRQn                  =   1, /**< 1   External Interrupt Controller (EIC) */
  FREQM_IRQn                =   2, /**< 2   Frequency Meter (FREQM)             */
  FLASH_CONTROL_IRQn        =   3, /**< 3   flash controller (NVM)              */
  CHANGE_NOTICE_A_IRQn      =   4, /**< 4   GPIO (GPIOA)                        */
  CHANGE_NOTICE_B_IRQn      =   5, /**< 5   GPIO (GPIOB)                        */
  DMAC_0_3_IRQn             =   6, /**< 6   Direct Memory Access Controller (DMAC) */
  DMAC_4_15_IRQn            =   7, /**< 7   Direct Memory Access Controller (DMAC) */
  EVSYS_0_3_IRQn            =   8, /**< 8   Event System Interface (EVSYS)      */
  EVSYS_4_11_IRQn           =   9, /**< 9   Event System Interface (EVSYS)      */
  PAC_IRQn                  =  10, /**< 10  Peripheral Access Controller (PAC)  */
  RAMECC_IRQn               =  11, /**< 11  RAM ECC (RAMECC)                    */
  SERCOM0_IRQn              =  12, /**< 12  Serial Communication Interface (SERCOM0) */
  SERCOM1_IRQn              =  13, /**< 13  Serial Communication Interface (SERCOM1) */
  TCC0_IRQn                 =  16, /**< 16  Timer Counter Control (TCC0)        */
  TCC1_IRQn                 =  17, /**< 17  Timer Counter Control (TCC1)        */
  TCC2_IRQn                 =  18, /**< 18  Timer Counter Control (TCC2)        */
  TC0_IRQn                  =  19, /**< 19  Basic Timer Counter (TC0)           */
  TC1_IRQn                  =  20, /**< 20  Basic Timer Counter (TC1)           */
  TC2_IRQn                  =  21, /**< 21  Basic Timer Counter (TC2)           */
  TC3_IRQn                  =  22, /**< 22  Basic Timer Counter (TC3)           */
  ADCHS_IRQn                =  23, /**< 23  12-bit Analog to Digital Converter (ADCHS) */
  AES_IRQn                  =  25, /**< 25  Advanced Encryption Standard (AES)  */
  TRNG_IRQn                 =  26, /**< 26  True Random Generator (TRNG)        */
  ICM_IRQn                  =  27, /**< 27  Integrity Check Monitor (ICM)       */
  PUKCC_IRQn                =  28, /**< 28  PUblic-Key Cryptography Controller (PUKCC) */
  QSPI_IRQn                 =  29, /**< 29  Quad SPI interface (QSPI)           */
  ZB_INT0_IRQn              =  30, /**< 30  ZIGBEE Radio Registers (ZIGBEE)     */
  BT_INT0_IRQn              =  31, /**< 31  BLE (BLE)                           */
  BT_INT1_IRQn              =  32, /**< 32  BLE (BLE)                           */
  ARBITER_IRQn              =  33, /**< 33  Radio Arbiter (ARB)                 */
  ADC_FAULT_IRQn            =  34, /**< 34  12-bit Analog to Digital Converter (ADCHS) */
  ADC_FCC_IRQn              =  35, /**< 35  12-bit Analog to Digital Converter (ADCHS) */
  ADC_BGVR_RDY_IRQn         =  36, /**< 36  12-bit Analog to Digital Converter (ADCHS) */
  CLKI_WAKEUP_NMI_IRQn      =  37, /**< 37  BLE (BLE)                           */
  BT_LC_IRQn                =  38, /**< 38  BLE (BLE)                           */
  BT_RC_IRQn                =  39, /**< 39  BLE (BLE)                           */

  PERIPH_MAX_IRQn           =  39  /**< Max peripheral ID */
} IRQn_Type;
