Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/include/pic32cx1012bz25032.h
/*
 * \brief CMSIS includes
 */
#include "core_cm4.h"
#if defined USE_CMSIS_INIT
#include "system_bz25.h"
#endif /* USE_CMSIS_INIT */

/** \defgroup PIC32CX1012BZ25032_api b'Peripheral Software API'
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CX1012BZ25032                */
/* ************************************************************************** */
#include "component/adchs.h"
#include "component/aes.h"
#include "component/arb.h"
#include "component/ble.h"
#include "component/btzbsys.h"
#include "component/ccl.h"
#include "component/cfg.h"
#include "component/cmcc.h"
#include "component/cru.h"
#include "component/dmac.h"
#include "component/dmt.h"
#include "component/dscon.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/freqm.h"
#include "component/gpio.h"
#include "component/hmatrixb.h"
#include "component/icm.h"
#include "component/nvm.h"
#include "component/pac.h"
#include "component/pche.h"
#include "component/pfw.h"
#include "component/pmu.h"
#include "component/pps.h"
#include "component/pukcc.h"
#include "component/qspi.h"
#include "component/ramecc.h"
#include "component/rcon.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/trng.h"
#include "component/wdt.h"
#include "component/zigbee.h"
/** @}  b'end of Peripheral Software API' */

/** \addtogroup PIC32CX1012BZ25032_id b'Peripheral Ids Definitions'
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CX1012BZ25032                          */
/* ************************************************************************** */
#define ID_PAC           (  0) /**< \brief Peripheral Access Controller (PAC) */
#define ID_FREQM         (  1) /**< \brief Frequency Meter (FREQM) */
#define ID_EIC           (  2) /**< \brief External Interrupt Controller (EIC) */
#define ID_SERCOM0       (  3) /**< \brief Serial Communication Interface (SERCOM0) */
#define ID_SERCOM1       (  4) /**< \brief Serial Communication Interface (SERCOM1) */
#define ID_TC0           (  5) /**< \brief Basic Timer Counter (TC0) */
#define ID_TC1           (  6) /**< \brief Basic Timer Counter (TC1) */
#define ID_TC2           (  7) /**< \brief Basic Timer Counter (TC2) */
#define ID_TC3           (  8) /**< \brief Basic Timer Counter (TC3) */
#define ID_TCC0          (  9) /**< \brief Timer Counter Control (TCC0) */
#define ID_TCC1          ( 10) /**< \brief Timer Counter Control (TCC1) */
#define ID_TCC2          ( 11) /**< \brief Timer Counter Control (TCC2) */
#define ID_DSU           ( 32) /**< \brief Device Service Unit (DSU) */
#define ID_CMCC          ( 33) /**< \brief Cortex M Cache Controller (CMCC) */
#define ID_DMAC          ( 34) /**< \brief Direct Memory Access Controller (DMAC) */
#define ID_EVSYS         ( 35) /**< \brief Event System Interface (EVSYS) */
#define ID_RAMECC        ( 36) /**< \brief RAM ECC (RAMECC) */
#define ID_QSPI          ( 64) /**< \brief Quad SPI interface (QSPI) */
#define ID_AES           ( 65) /**< \brief Advanced Encryption Standard (AES) */
#define ID_CCL           ( 70) /**< \brief Configurable Custom Logic (CCL) */
#define ID_HMATRIX       ( 73) /**< \brief HSB Matrix (HMATRIX) */
#define ID_TRNG          ( 74) /**< \brief True Random Generator (TRNG) */
#define ID_ICM           ( 75) /**< \brief Integrity Check Monitor (ICM) */
#define ID_PUKCC         ( 76) /**< \brief PUblic-Key Cryptography Controller (PUKCC) */
#define ID_RTC           ( 78) /**< \brief Real-Time Counter (RTC) */
#define ID_DSCON         ( 79) /**< \brief  (DSCON) */

#define ID_PERIPH_MAX    ( 79) /**< \brief Number of peripheral IDs */
/** @}  b'end of Peripheral Ids Definitions' */

/** \addtogroup PIC32CX1012BZ25032_base b'Peripheral Base Address Definitions'
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CX1012BZ25032            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define ADCHS_REGS                       ((adchs_registers_t*)0x44001400)              /**< \brief ADCHS Registers Address      */
#define AES_REGS                         ((aes_registers_t*)0x42000400)                /**< \brief AES Registers Address        */
#define BLE_REGS                         ((ble_registers_t*)0x41012000)                /**< \brief BLE Registers Address        */
#define BTZBSYS_REGS                     ((btzbsys_registers_t*)0x41014000)            /**< \brief BTZBSYS Registers Address    */
#define CCL_REGS                         ((ccl_registers_t*)0x42001800)                /**< \brief CCL Registers Address        */
#define CFG_REGS                         ((cfg_registers_t*)0x44000000)                /**< \brief CFG Registers Address        */
#define CMCC_REGS                        ((cmcc_registers_t*)0x41002000)               /**< \brief CMCC Registers Address       */
#define CRU_REGS                         ((cru_registers_t*)0x44000a00)                /**< \brief CRU Registers Address        */
#define RCON_REGS                        ((rcon_registers_t*)0x44000a00)               /**< \brief RCON Registers Address       */
#define DMAC_REGS                        ((dmac_registers_t*)0x41004000)               /**< \brief DMAC Registers Address       */
#define DMT_REGS                         ((dmt_registers_t*)0x44000e00)                /**< \brief DMT Registers Address        */
#define DSCON_REGS                       ((dscon_registers_t*)0x42011000)              /**< \brief DSCON Registers Address      */
#define DSU_REGS                         ((dsu_registers_t*)0x41000000)                /**< \brief DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40000800)                /**< \brief EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x41006000)              /**< \brief EVSYS Registers Address      */
#define NVM_REGS                         ((nvm_registers_t*)0x44000600)                /**< \brief NVM Registers Address        */
#define FREQM_REGS                       ((freqm_registers_t*)0x40000400)              /**< \brief FREQM Registers Address      */
#define GPIOA_REGS                       ((gpio_registers_t*)0x44002200)               /**< \brief GPIOA Registers Address      */
#define GPIOB_REGS                       ((gpio_registers_t*)0x44002300)               /**< \brief GPIOB Registers Address      */
#define HMATRIX_REGS                     ((hmatrixb_registers_t*)0x42002400)           /**< \brief HMATRIX Registers Address    */
#define ICM_REGS                         ((icm_registers_t*)0x42002c00)                /**< \brief ICM Registers Address        */
#define PAC_REGS                         ((pac_registers_t*)0x40000000)                /**< \brief PAC Registers Address        */
#define PCHE_REGS                        ((pche_registers_t*)0x44012400)               /**< \brief PCHE Registers Address       */
#define PFW_REGS                         ((pfw_registers_t*)0x44000800)                /**< \brief PFW Registers Address        */
#define PMU_REGS                         ((pmu_registers_t*)0x44013e00)                /**< \brief PMU Registers Address        */
#define PPS_REGS                         ((pps_registers_t*)0x44001000)                /**< \brief PPS Registers Address        */
#define QSPI_REGS                        ((qspi_registers_t*)0x42000000)               /**< \brief QSPI Registers Address       */
#define RAMECC_REGS                      ((ramecc_registers_t*)0x41008000)             /**< \brief RAMECC Registers Address     */
#define RTC_REGS                         ((rtc_registers_t*)0x42010000)                /**< \brief RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x40000c00)             /**< \brief SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x40001000)             /**< \brief SERCOM1 Registers Address    */
#define TC0_REGS                         ((tc_registers_t*)0x40001400)                 /**< \brief TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x40001800)                 /**< \brief TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x40001c00)                 /**< \brief TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x40002000)                 /**< \brief TC3 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x40002400)                /**< \brief TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x40002800)                /**< \brief TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x40002c00)                /**< \brief TCC2 Registers Address       */
#define TRNG_REGS                        ((trng_registers_t*)0x42002800)               /**< \brief TRNG Registers Address       */
#define WDT_REGS                         ((wdt_registers_t*)0x44000500)                /**< \brief WDT Registers Address        */
#define ZIGBEE_REGS                      ((zigbee_registers_t*)0x41010000)             /**< \brief ZIGBEE Registers Address     */
#define ARB_REGS                         ((arb_registers_t*)0x41011000)                /**< \brief ARB Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  b'end of Peripheral Base Address Definitions' */

/** \addtogroup PIC32CX1012BZ25032_base b'Peripheral Base Address Definitions'
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CX1012BZ25032                          */
/* ************************************************************************** */
#define ADCHS_BASE_ADDRESS               _UL_(0x44001400)                              /**< \brief ADCHS Base Address */
#define AES_BASE_ADDRESS                 _UL_(0x42000400)                              /**< \brief AES Base Address */
#define BLE_BASE_ADDRESS                 _UL_(0x41012000)                              /**< \brief BLE Base Address */
#define BTZBSYS_BASE_ADDRESS             _UL_(0x41014000)                              /**< \brief BTZBSYS Base Address */
#define CCL_BASE_ADDRESS                 _UL_(0x42001800)                              /**< \brief CCL Base Address */
#define CFG_BASE_ADDRESS                 _UL_(0x44000000)                              /**< \brief CFG Base Address */
#define CMCC_BASE_ADDRESS                _UL_(0x41002000)                              /**< \brief CMCC Base Address */
#define CRU_BASE_ADDRESS                 _UL_(0x44000a00)                              /**< \brief CRU Base Address */
#define RCON_BASE_ADDRESS                _UL_(0x44000a00)                              /**< \brief RCON Base Address */
#define DMAC_BASE_ADDRESS                _UL_(0x41004000)                              /**< \brief DMAC Base Address */
#define DMT_BASE_ADDRESS                 _UL_(0x44000e00)                              /**< \brief DMT Base Address */
#define DSCON_BASE_ADDRESS               _UL_(0x42011000)                              /**< \brief DSCON Base Address */
#define DSU_BASE_ADDRESS                 _UL_(0x41000000)                              /**< \brief DSU Base Address */
#define EIC_BASE_ADDRESS                 _UL_(0x40000800)                              /**< \brief EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UL_(0x41006000)                              /**< \brief EVSYS Base Address */
#define NVM_BASE_ADDRESS                 _UL_(0x44000600)                              /**< \brief NVM Base Address */
#define FREQM_BASE_ADDRESS               _UL_(0x40000400)                              /**< \brief FREQM Base Address */
#define GPIOA_BASE_ADDRESS               _UL_(0x44002200)                              /**< \brief GPIOA Base Address */
#define GPIOB_BASE_ADDRESS               _UL_(0x44002300)                              /**< \brief GPIOB Base Address */
#define HMATRIX_BASE_ADDRESS             _UL_(0x42002400)                              /**< \brief HMATRIX Base Address */
#define ICM_BASE_ADDRESS                 _UL_(0x42002c00)                              /**< \brief ICM Base Address */
#define PAC_BASE_ADDRESS                 _UL_(0x40000000)                              /**< \brief PAC Base Address */
#define PCHE_BASE_ADDRESS                _UL_(0x44012400)                              /**< \brief PCHE Base Address */
#define PFW_BASE_ADDRESS                 _UL_(0x44000800)                              /**< \brief PFW Base Address */
#define PMU_BASE_ADDRESS                 _UL_(0x44013e00)                              /**< \brief PMU Base Address */
#define PPS_BASE_ADDRESS                 _UL_(0x44001000)                              /**< \brief PPS Base Address */
#define QSPI_BASE_ADDRESS                _UL_(0x42000000)                              /**< \brief QSPI Base Address */
#define RAMECC_BASE_ADDRESS              _UL_(0x41008000)                              /**< \brief RAMECC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0x42010000)                              /**< \brief RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UL_(0x40000c00)                              /**< \brief SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UL_(0x40001000)                              /**< \brief SERCOM1 Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0x40001400)                              /**< \brief TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0x40001800)                              /**< \brief TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UL_(0x40001c00)                              /**< \brief TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UL_(0x40002000)                              /**< \brief TC3 Base Address */
#define TCC0_BASE_ADDRESS                _UL_(0x40002400)                              /**< \brief TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UL_(0x40002800)                              /**< \brief TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UL_(0x40002c00)                              /**< \brief TCC2 Base Address */
#define TRNG_BASE_ADDRESS                _UL_(0x42002800)                              /**< \brief TRNG Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0x44000500)                              /**< \brief WDT Base Address */
#define ZIGBEE_BASE_ADDRESS              _UL_(0x41010000)                              /**< \brief ZIGBEE Base Address */
#define ARB_BASE_ADDRESS                 _UL_(0x41011000)                              /**< \brief ARB Base Address */
/** @}  b'end of Peripheral Base Address Definitions' */

/** \addtogroup PIC32CX1012BZ25032_pio b'Peripheral Pio Definitions'
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CX1012BZ25032                                   */
/* ************************************************************************** */
#include "pio/pic32cx1012bz25032.h"
/** @}  b'end of Peripheral Pio Definitions' */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CX1012BZ25032                        */
/* ************************************************************************** */

#define CMCC_SIZE                      _UL_(0x01000000)    /* 16384kB Memory segment type: io */
#define CMCC_DATARAM_SIZE              _UL_(0x00001000)    /*    4kB Memory segment type: io */
#define CMCC_TAGRAM_SIZE               _UL_(0x00000400)    /*    1kB Memory segment type: io */
#define CMCC_VALIDRAM_SIZE             _UL_(0x00000040)    /*    0kB Memory segment type: io */
#define HSRAM_SIZE                     _UL_(0x00020000)    /*  128kB Memory segment type: ram */
#define HSRAM_ETB_SIZE                 _UL_(0x00008000)    /*   32kB Memory segment type: ram */
#define HSRAM_RET1_SIZE                _UL_(0x00008000)    /*   32kB Memory segment type: ram */
#define PBA_SIZE                       _UL_(0x01000000)    /* 16384kB Memory segment type: io */
#define PBB_SIZE                       _UL_(0x01000000)    /* 16384kB Memory segment type: io */
#define PBC_SIZE                       _UL_(0x01000000)    /* 16384kB Memory segment type: io */
#define PB_PIC_SIZE                    _UL_(0x00020000)    /*  128kB Memory segment type: io */
#define BKUPRAM_SIZE                   _UL_(0x00002000)    /*    8kB Memory segment type: ram */
#define FLASH_SIZE                     _UL_(0x00100000)    /* 1024kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UL_(      4096)
#define FLASH_NB_OF_PAGES              _UL_(       256)

#define PPB_SIZE                       _UL_(0x00100000)    /* 1024kB Memory segment type: io */
#define QSPI_SIZE                      _UL_(0x01000000)    /* 16384kB Memory segment type: other */
#define SCS_SIZE                       _UL_(0x00001000)    /*    4kB Memory segment type: io */
#define BOOT_FLASH_SIZE                _UL_(0x00005e00)    /*   23kB Memory segment type: flash */

#define CMCC_ADDR                      _UL_(0x03000000)    /**< CMCC base address (type: io)*/
#define CMCC_DATARAM_ADDR              _UL_(0x03000000)    /**< CMCC_DATARAM base address (type: io)*/
#define CMCC_TAGRAM_ADDR               _UL_(0x03001000)    /**< CMCC_TAGRAM base address (type: io)*/
#define CMCC_VALIDRAM_ADDR             _UL_(0x03002000)    /**< CMCC_VALIDRAM base address (type: io)*/
#define HSRAM_ADDR                     _UL_(0x20000000)    /**< HSRAM base address (type: ram)*/
#define HSRAM_ETB_ADDR                 _UL_(0x20000000)    /**< HSRAM_ETB base address (type: ram)*/
#define HSRAM_RET1_ADDR                _UL_(0x20000000)    /**< HSRAM_RET1 base address (type: ram)*/
#define PBA_ADDR                       _UL_(0x40000000)    /**< PBA base address (type: io)*/
#define PBB_ADDR                       _UL_(0x41000000)    /**< PBB base address (type: io)*/
#define PBC_ADDR                       _UL_(0x42000000)    /**< PBC base address (type: io)*/
#define PB_PIC_ADDR                    _UL_(0x44000000)    /**< PB_PIC base address (type: io)*/
#define BKUPRAM_ADDR                   _UL_(0x44014000)    /**< BKUPRAM base address (type: ram)*/
#define FLASH_ADDR                     _UL_(0x01000000)    /**< FLASH base address (type: flash)*/
#define PPB_ADDR                       _UL_(0xe0000000)    /**< PPB base address (type: io)*/
#define QSPI_ADDR                      _UL_(0x04000000)    /**< QSPI base address (type: other)*/
#define SCS_ADDR                       _UL_(0xe000e000)    /**< SCS base address (type: io)*/
#define BOOT_FLASH_ADDR                _UL_(0x00000000)    /**< BOOT_FLASH base address (type: flash)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR PIC32CX1012BZ25032                                 */
/* ************************************************************************** */
#define CHIP_JTAGID                    _UL_(0X09B0F053)
#define CHIP_DSU_DID                   _UL_(0X00009B0F)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR PIC32CX1012BZ25032                            */
/* ************************************************************************** */

